In [1]:
import pandas as pd
from datetime import timedelta, datetime
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os
import prepare as pre
# plotting defaults
plt.rc('figure', figsize=(6, 4))
plt.style.use('seaborn-whitegrid')
plt.rc('font', size=8)

In [2]:
filename = 'opsd_data.csv'
df = pd.read_csv(filename,index_col=0)

In [3]:
pre.convert_date_opsd(df)

In [ ]:
df.head()

In [ ]:
df.info()

In [ ]:
pre.get_hist(df)

In [ ]:
# df = df.set_index('Date').sort_index()

In [4]:
df = pre.date_info_cols_opsd(df)

In [5]:
df.head()

        Date  Consumption  Wind  Solar  Wind+Solar  month  day_of_week
0 2006-01-01     1069.184   NaN    NaN         NaN      1            6
1 2006-01-02     1380.521   NaN    NaN         NaN      1            0
2 2006-01-03     1442.533   NaN    NaN         NaN      1            1
3 2006-01-04     1457.217   NaN    NaN         NaN      1            2
4 2006-01-05     1477.131   NaN    NaN         NaN      1            3

In [6]:
df = pre.index_date_opsd(df)

In [7]:
df.head()

            Consumption  Wind  Solar  Wind+Solar  month  day_of_week
Date
2006-01-01     1069.184   NaN    NaN         NaN      1            6
2006-01-02     1380.521   NaN    NaN         NaN      1            0
2006-01-03     1442.533   NaN    NaN         NaN      1            1
2006-01-04     1457.217   NaN    NaN         NaN      1            2
2006-01-05     1477.131   NaN    NaN         NaN      1            3

In [8]:
df.isna().sum()

Consumption       0
Wind           1463
Solar          2195
Wind+Solar     2196
month             0
day_of_week       0
dtype: int64

In [9]:
df.fillna(0,inplace=True)

In [10]:
df.isna().sum()

Consumption    0
Wind           0
Solar          0
Wind+Solar     0
month          0
day_of_week    0
dtype: int64

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 4383 entries, 2006-01-01 to 2017-12-31
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Consumption  4383 non-null   float64
 1   Wind         4383 non-null   float64
 2   Solar        4383 non-null   float64
 3   Wind+Solar   4383 non-null   float64
 4   month        4383 non-null   int64
 5   day_of_week  4383 non-null   int64
dtypes: float64(4), int64(2)
memory usage: 239.7 KB